а =  1 # целое число
a = 1.0 # вещественное число
а = 1 + 1J # комплексное число
а = True # булевое значение
a = None # пустой тип
# составные
a = 'hello' # строка
a = [1,1.0,'hello'] # список
a = ( 1,1.0,'hello') #кортеж
a = {1,1.0,'hello'} # множество
a = frozenset ({{1,1.0,'hello'}) # неизменяемое множество
a = { 'a' : 1 ,'b' : 2} # словарь
a = b'hello' # байтовый тип
a = bytearray(b'hellO')')
a = [1,1.0,'hello'] # создаем список
help(a) # выводим информацию об 'а'
print (a) # выводим значение 'а' в консоль
b = input( 'Введи число') # в консоль выводится  сособщение и ожидается когда пользователь введет число
len(a) # сколько объектов в 'а'
min(a) # минимальное значение в 'а'
max(a) # максимальное значение в 'а'
type(a) # тип объекта 'a'


